# 2. Напишите программу, которая на вход принимает 5 чисел 
# и находит максимальное из них.
#   Примеры:
#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90

# print('Введите a')
# a = int(input())
# print('Введите b')
# b = int(input())
# print('Введите c')
# c = int(input())
# print('Введите d')
# d = int(input())
# print('Введите e')
# e = int(input())
# max_number = a
# if a<b:
#     max_number = b
# if b<c:
#     max_number = c
# if c<d:
#     max_number = d
# if d<e:
#     max_number = e 
# print(max_number) 

# numbers = []
# for i in range(5):
#     numbers.append(int(input(f'Введите элемент под номером {i}: ')))
# print(numbers)
# print(max(numbers))

# num10 = int( input(' введите число1: ')) # вводим цифру
# num20 = int( input(' введите число2: '))
# num30 = int( input(' введите число3: ')) 
# num40 = int( input(' введите число4: '))
# num50 = int( input(' введите число5: '))
 
# if num10 > num20 and num10 > num30 and num10 > num40 and num10 > num50:
#     print(f'{num10} - максимальное число')
# elif num20 > num10 and num20 > num30 and num20 > num40 and num20 > num50:
#     print(f'{num20} - максимальное число')
# elif num30 > num10 and num30 > num20 and num30 > num40 and num30 > num50:
#     print(f'{num30} - максимальное число')
# elif num40 > num10 and num40 > num20 and num40 > num30 and num40 > num50:
#     print(f'{num40} - максимальное число')
# else:
#     print(f'{num50} максимальное')


# numbers = [1, 4, 6, 2, 3]
# for i in range(1,6):
#     numbers.append(int(input(f'Введите элемент под номером {i}: ')))
# print(numbers)
# print(max(numbers))

# my_max = 0
# for _ in range(5):
#     num = int(input('Введите число: '))
#     if my_max < num:
#         my_max = num
# print(my_max)

