# 1. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число.
#  В качестве символа-разделителя используйте пробел.

# lenght_list = 10
   
# my_list = [random.randint(0,10) for i in range(lenght_list)]

# list_num = input("Print numbers: ").split()
# print(list_num)

# list_num = list(map(int, list_num))
# print(max(list_num), min(list_num))

# list_num = input('Введите числа через пробел').split()
# print(list_num)

# list_num = list(map(int, list_num)) # переводим список строк в список чисел
# print(max(list_num), min(list_num)) # выводим максимальное и минимальное

# def random_str(num_list):
#     str1 = ''
#     for i in range(10):
#         str1 = str1 + str(num_list[i])+' '

